import style from './Articles.module.css';
import Accordion from 'react-bootstrap/Accordion';


const Articles = () => {
  return <div className={style.MainPage}>
     <Accordion>
      <Accordion.Item eventKey="0">
        <Accordion.Header><strong>1. Про принятие</strong></Accordion.Header>
        <Accordion.Body>
        <h2>ПРИНЯТИЕ – КЛЮЧ К БЕЗГРАНИЧНОЙ ЛЮБВИ К СЕБЕ</h2>
        <p>Принятие себя – базовая характеристика личности, не позволяющая внешним факторам негативно сказываться на существовании человека и его развитии.</p>
        <p>Индивид, который абсолютно и полностью принимает себя, не подвержен плохому настроению и излишним потерям энергии из-за стороннего мнения или сложившихся трудных обстоятельств.</p>
        <p>Принятие не является врожденной характеристикой, а воспитывается в течение дошкольного детства. Основа самопринятия закладывается в младенческом возрасте с опорой на материнское самоотношение.</p>
        <p>Каждый ребёнок при рождении идентифицирует себя с матерью. Первые 3 месяца он не осознаёт, что является отдельной личностью. Самоидентификация происходит чуть позже, примерно месяцам к 6 и протекает по-разному у мальчиков и девочек.</p>
        <p>Если у тебя есть проблемы с самопринятием, то нужно обратиться именно к раннему возрасту. Посмотри, выясни, как относилась к тебе мама, была ли она рада своей беременности и появлению тебя на свет. Также подумай, насколько родители были рады, что родилась именно ты (девочка).</p>
        <p>Если ты принимаешь себя, то можешь отметить такие качества:</p>
        <ul>
          <li>ты редко сомневаешься в своём выборе, будь то выбор вещи в магазине, мебели для квартиры или поиск партнера по отношениям;</li>
          <li>ты не завидуешь. Если подруга приобрела новое платье, а коллега сбросила пару лишних кило, то ты только порадуешься за них;</li>
          <li>ты довольна своим внешним видом, даже если у тебя есть лишний вес или особенности внешности;</li>
          <li>тебя ценят практически все твои знакомые – самоотношение влияет на принятие другими индивидами;</li>
          <li>ты не склонна давать советы, если тебя не спрашивают. Чрезмерная тяга к высказыванию своего мнения с одной стороны свидетельствует о завышенной самооценке, а с другой – о желании быть замеченной. И в том и другом случае, самопринятия нет.</li>
        </ul>
        <p>Таким образом, принятие себя – это принятие не только своего внешнего, но и внутреннего мира, уважение своего выбора и выбора постороннего человека. Девушка, которая полностью и абсолютно довольна собой не будет вступать в ненужные споры, распускать сплетни, унижать и оскорблять людей за особенности их внешности или образ жизни.</p>
        <p>Кстати, то, как ты себя принимаешь сказывается на других областях жизни. Если с самопринятием все в порядке, то и в личной, финансовой и прочих сферах будет царить успех. Приведем пример: твоя подруга устраивается на работу с зарплатой в 2 раза выше, чем у тебя, хотя до твоего уровня профессионализма она не дотягивает. Дело в том, что подруга принимает себя в большей степени, и считает, что ее труды должны оплачиваться выше.</p>
        <h2>Как научиться принимать себя?</h2>
        <p>Как выяснили ранее, принятие себя – это базовая черта личности, которая формируется с раннего возраста. Если мама принимает себя, то с большой вероятностью у ребенка не будет проблем с этим качеством. Конечно, и отношения с отцом играют не последнюю роль, поскольку отец является первым мужским примером дочери. То, как он оценивает ее характер, внешность, так и будут в дальнейшем к ней относиться молодые люди.</p>
        <p>Чтобы принять себя необходимо провести анализ своей жизни. В этом помогут следующие советы:</p>
        <ul>
        <li>посмотри на то, как твоя мама относится к себе: насколько она собой довольна и насколько она пытается в себе что-то изменить. Проанализируй, не копируешь ли ты ее самоотношение;</li>
        <li>проанализируй свое мироощущение. Оцени, не склонна ли ты к сплетням, зависти, грубости. Подумай, как часто ты сравниваешь себя с другими людьми;</li>
        <li>начерти круг и раздели его на 8 частей. Каждую часть подпиши: внешность, фигура, здоровье, ум и саморазвитие, организованность, хозяйственность, взаимоотношения, карьера. Зарисуй те части, в которых, как ты считаешь, есть проблемы.</li>
        </ul>
        <p>Методика анализ 8 частей позволяет начать работу по коррекции самопринятия. Лишь малый процент людей оставит белыми все 8 сфер, поскольку различные аспекты твоей личности и атмосферы ее существования не могут удовлетворяться все и сразу. В любом случае какая-нибудь часть будет зачеркнута.</p>
        <p>Путь к совершенству часто оказывается навязанным из вне. Однако, качество жизни, твои ценности и интересы должны выбираться только тобой лично. В противном случае, будет страдать самопринятие и самооценка. Начиная путь к принятию себя, начни с диагностики, а затем действуй следующим образом:</p>
        <ul><li>не критикуй и не позволяй критиковать себя, как личность.</li></ul>
       <p>Да, возможно ты выполнила работу не с той долей качества, на какую рассчитывал начальник, но это качество работы, а не твоей личности. Не принимай критику близко к сердцу, но исправь то, что выполнено плохо;</p>
       <ul><li>помни, что всем угодит невозможно.</li></ul>
        <p>У каждого человека свои вкусы и мнения, которые могут полностью не соответствовать твоим. Поэтому нет смысла прилагать массу усилий для того, чтобы добиться хорошего отношения от каждого. Друзья примут тебя такой, какая ты есть, с недостатками и достоинствами, а другие не будут с ними мириться. Не трать время;</p>
        <ul><li>признавай свое право на ошибки.</li></ul>
        <p>Не стоит создавать драму каждый раз, когда что-то идет не так. должна относиться к любой ситуации с определенной философией, оптимизмом и даже с юмором. Без ошибок нет развития.</p>
        <p>В заключении приведем простое упражнение. Возьми лист бумаги и просто укажи все свои недостатки и достоинства, которые определяют тебя как личность. Будь честна с собой, и ты увидишь, сколько хороших качеств в тебе есть.</p>
        <p>Таким образом, психология принятия себя является базовой в психологии личности. На самом деле самый малый процент людей принимает свою личность со всеми достоинствами и недостатками. Тем не менее, нужно стремиться к полному самопринятию и дать себе право на ошибки.</p>
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="1">
        <Accordion.Header><strong>2. Работа с зеркалом</strong></Accordion.Header>
        <Accordion.Body>
          <h2>ЧТО ТАКОЕ РАБОТА С ЗЕРКАЛОМ?</h2>
          <p>Работа с зеркалом – глубокий взгляд себе в глаза и повторение аффирмаций – научит вас любить себя и видеть мир безопасным и полным любви. Я уже давно рассказываю людям о принципах и плюсах работы с зеркалом – так же давно, как преподаю науку аффирмаций. Говоря проще, независимо от того, что мы произносим или думаем, все это аффирмации. Весь ваш разговор с собой, диалог, происходящий в вашей голове, есть поток аффирмаций. Эти аффирмации – сообщения, адресованные вашему подсознанию, они определяют привычные способы мышления и поведенческие модели. Положительные аффирмации порождают целебные мысли и идеи, которые поддерживают вас и вселяют уверенность, повышают самооценку, умиротворяют ум и наделяют внутренней радостью.</p>
          <p>Самые сильные аффирмации вы произносите вслух, находясь перед зеркалом. Зеркало отражает чувства, которые вы испытываете по отношению к себе. Вы сразу начинаете осознавать, когда именно сопротивляетесь, а когда открыты и расслаблены. Зеркало ясно показывает, какие мысли вам нужно будет в себе изменить, если вы хотите иметь счастливую, наполненную положительными эмоциями жизнь.</p>
          <h2>ПОЛЬЗА РАБОТЫ С ЗЕРКАЛОМ</h2>
          <p>Подобно тому, как зеркало отражает ваш образ, так и опыт отражает ваши внутренние убеждения.</p>
          <p>По мере вашего обучения вы намного больше узнаете о том, что говорите и что делаете. Вы научитесь заботиться о себе на более глубоком уровне, чем делали это раньше. Когда в вашей жизни случится что-нибудь хорошее, вы сможете подойти к зеркалу и сказать: «Спасибо, спасибо. Это потрясающе! Спасибо за то, что это произошло». Если с вами произойдет нечто плохое, вы также сможете подойти к зеркалу и произнести: «Ладно, я люблю тебя. То, что только что случилось, пройдет, но я люблю тебя, и это навсегда».</p>
          <p>Для большинства из нас сидеть перед зеркалом и смотреть прямо на себя поначалу покажется трудным, поэтому мы называем это работой с зеркалом. Но со временем вы станете менее придирчивыми, и работа превратится в игру с зеркалом. Очень скоро зеркало станет вашим товарищем, дорогим другом, а не врагом.</p>
          <p>Выполнение работы с зеркалом – это один из великих даров любви, который вы можете себе позволить. Требуется только секунда, чтобы сказать: «Привет, малыш», «Хорошо выглядишь» или «Разве это не забавно?» Очень важно посылать себе в течение дня небольшие положительные сообщения. Чем чаще вы используете зеркало, чтобы похвалить себя, одобрить свои поступки и поддержать себя в трудное время, тем глубже и приятнее станут ваши отношения с собой.</p>
          <p>Важно работать перед зеркалом хотя бы течении 21 дня. Вы спросите почему именно 21 день? Разве можно полностью изменить свою жизнь всего лишь за три недели? Полностью, может, и не получится. Но можно заронить семена перемен. По мере того как вы совершаете работу с зеркалом, эти семена произрастают в новые, здоровые привычки ума, которые открывают двери счастливой и наполненной жизни.</p>
          <p>Так давайте же начнем!</p>
          <p>Любовь – это самая мощная целебная сила. Вы можете выпустить эту любовь в мир и мысленно поделиться ею со всеми людьми, которых встречаете.»</p>
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="2">
        <Accordion.Header><strong>3. Личные границы</strong></Accordion.Header>
        <Accordion.Body>
          <h2>ЧТО ТАКОЕ ЛИЧНЫЕ ГРАНИЦЫ И КАК ИХ У СЕБЯ НАЙТИ?</h2>
          <p>Личные границы — это сугубо ваше личное пространство, индивидуальная сфера интересов, принципов и убеждений. Ее как бы отделяет от других людей невидимая черта. Но личные границы нестатичны, они изменяются, в зависимости от степени близости вам конкретных людей. Ведь родных вы посвящаете в свою жизнь гораздо больше, чем знакомых, приятелей или чужих людей с улицы.</p>
        <p>Личные границы позволяют выстроить и защитить свой уникальный мир, оберегают самооценку человека и помогают расставлять приоритеты в жизни. Благодаря личным границам человек может быть в какие-то моменты то сильным, то слабым и, главное, всегда оставаться верным себе.</p>
        <p>Увидеть эти границы, конечно, нельзя, но каждый из нас их чувствует. У всех личные границы разные. Кто-то ездит в общественном транспорте и свободно находится в обществе незнакомых людей, а кто-то покупает машину специально для того, чтобы оградить свое пространство от вторжения других личностей.</p>
        <p>Но и у личных границ есть свои признаки «здравости». Первый из них — когда вы признаете индивидуальные проявления других людей и «разрешаете» им быть непохожими на вас. Второй признак — это когда вы четко разделяете окружающих на тех, кого пускаете очень близко, кому разрешено проникать в вашу жизнь частично, и тех, кого вы не желаете впускать вовсе. Третье: вы умеете абстрагироваться от неприятных или опасных ситуаций, чтобы не дать им нарушить ваши границы.</p>
        <p>Самый главный признак, что с вашими границами все в порядке, — это когда вам комфортно. Если окружающие люди своими словами, либо действиями причиняют вам физический или эмоциональный дискомфорт — это и есть нарушение личных границ.</p>
        <h2>10 ЗАКОНОВ ЗДОРОВЫХ ГРАНИЦ</h2>
        <p>1. Все действия имеют последствия. Если кто-то в вашей жизни проявлял насилие, жестокость, эгоизм по отношению к вам, устанавливали ли вы границы? Или все это происходит снова и снова без последствий для них?</p>
        <p>2. Закон ответственности. Мы отвечаем друг перед другом, но не друг за друга. Это значит не поощрять и не провоцировать чье-либо инфантильное поведение.</p>
        <p>3. Власть имеет границы. Мы имеем власть над некоторыми вещами, но мы не имеем власти изменять других людей. В нашей власти только изменить свою собственную жизнь.</p>
        <p>4. Закон уважения. Если мы хотим, чтобы другие уважали наши границы, мы должны уважать их границы тоже.</p>
        <p>5. Свобода выбора. Мы должны быть свободны сказать «нет» или сказать «да» с чистым сердцем. Нельзя любить человека только потому, что его жалко и он не оставляет вам иного выбора.</p>
        <p>6. Нужно оценивать, какую боль установление наших границ приносит другим. Наши границы причиняют боль, которая потом приведет к исцелению и росту? Или боль, которая их лишь ранит?</p>
        <p>7. Закон проактивности. Мы предпринимаем активные действия, чтобы решить проблемы, опираясь на наши ценности и желания. Проактивные люди защищают свою свободу и выражают несогласие, но не поднимая эмоциональной бури.</p>
        <p>8. Закон зависти. Мы никогда не получим того, что мы хотим, если будем устанавливать свои границы исходя из того, что имеют другие. Завистливый человек просто не видит своих границ исходя из тех выборов, которые у него есть.</p>
        <p>9. Закон активности. Нужно не ждать от других, что они сделают первое движение.</p>
        <p>10. Нужно сообщать о своих границах. Граница, о которой никто не знает, — это не граница. Мы должны очень четко дать понять другому, что мы хотим и что не хотим, что будем терпеть и что не будем. Мы также должны ясно дать понять, что каждое нарушение границ имеет последствия.</p>
        <p>Помните, что грамотно выстроенные личные границы — это невидимые стражники внутреннего мира. Они защищают, позволяют оставаться самим собой, дают уверенность в себе. Очень важно периодически донастраивать личные границы до комфортного состояния, беречь их, тогда жить станет значительно легче.</p>
        
        </Accordion.Body>
      </Accordion.Item>
      <Accordion.Item eventKey="3">
        <Accordion.Header><strong>4. Эмоциональная саморегуляция</strong></Accordion.Header>
        <Accordion.Body>
          <p>Говоря об управлении эмоциями, психологи отмечают необходимость не контроля отрицательных эмоций как непосредственных, достаточно кратковременных, неприятных переживаний, но изменения эмоций на «уместные». Эмоции рассматриваются как уместные, если в их основе лежат рациональные установки, которые не блокируют возможность эффективного действия и достижения фундаментальных первичных целей. К деструктивным же эмоциям относят те из них, которые приносят вред нам самим или другим людям. Данные эмоции искажают восприятие реальности. Деструктивные эмоции нарушают спокойствие, упорядоченность и равновесие ума, в то время как конструктивные усиливают это равновесие.</p>
          <p>Общим для «неуместных» и «деструктивных» эмоций является то, что они возникают вследствие неправильного когнитивного представления ситуации. Неправильное восприятие часто возникает как результат определенных ожиданий. Рассогласование ожиданий и реальности, действия и результата вызывает неприятные переживания. Чем значимее наши ожидания, чем больше желаний воплощено в них, тем сильнее реакция на рассогласование с реальностью.</p>
          <p>Как можно регулировать эмоции?</p>
          <p>1. Снижение негативных эмоций гнева и страха</p>
          <h2>Гнев</h2>
          <p> возникает, как правило, когда нарушены некоторые наши представления о том, что хорошо, а что — плохо. Вы знаете, как «правильно», а ситуация или поведение человека этому «правильно» не соответствуют. Здесь полезно задать себе вопрос, а в самом ли деле верно то, что я себе представляю? Гнев — это, как правило, вторичная реакция: ему предшествуют или обида, или страх, или беспомощность. Он позволяет «канализировать» эти эмоции. Однако подобная реакция совсем не безопасна для окружающих.</p>
          <p>Как себя вести с гневливым человеком? Нельзя защищать себя, объяснять свои слова и поступки, не стоит начинать извиняться или нападать, давать советы или проявлять снисходительность, нельзя отрицать эмоции гневающегося человека или давать им иное толкование. В отношениях с близким человеком нужно:</p>
        <ul>
          <li>отражать его чувства («Ты назвал меня неряхой»),</li>
          <li>пытаться их разъяснить («Что с тобой происходит? Возможно, ты много работаешь последнее время»). Можно</li>
          <li>обозначить неопределенность («Я не совсем понимаю, что ты чувствуешь, когда так говоришь») и присоединиться к его переживаниям («Если бы я был(а) на твоем месте, я бы тоже возмутился(-ась)»).</li>
          </ul>
          <p>Постарайтесь замедлить темп речи разъяренного человека. Можно попросить: «Говорите, пожалуйста, помедленнее, я буду записывать. Повторите, пожалуйста». Это позволяет человеку более четко формулировать свои мысли и постепенно успокаиваться.</p>
          <p>Гнев не всегда вреден для самого человека и для окружающих его людей. Довольно часто приходится защищать себя не столько от физической, сколько от психологической угрозы. В этом случае умеренный, регулируемый гнев помогает отстаивать свои права и позволяет предпринимать определенные действия в целях самозащиты</p>
          <h2>Страх.</h2>
          <p> Когда же вы боитесь чего-либо (например проверки), вам может помочь информация от более опытных коллег, которая устранит чувство неопределенности. Спросите их о том, как обычно проходит проверка, что представляют собой проверяющие, каким аспектам деятельности они уделяют наибольшее внимание — тем самым сделайте беспокоящую вас ситуацию более предсказуемой.</p>
          <p>Страх также может отступить под воздействием иной эмоции. Так, если пугающая ситуация способна вызвать у вас злость, то вы, скорее всего, не испытаете сильного страха. Вы боитесь? Разозлитесь на себя, на ситуацию или людей, которые заставляют вас испытывать страх — интенсивность этой эмоции снизится. Или, если кто-то кажется вам страшным, мысленно сделайте его смешным: представьте его в неуклюжей позе и в непрезентабельной одежде. Тот, кто смешон, не может быть страшным.</p>
          <p>Снижению тревожности способствует развитие у себя чувства благодарности. Тревожные люди обычно «зациклены» на своей будущей цели или прошлых неудачах, и не замечают вкуса мгновений настоящего. Найдите прекрасное в обыденных вещах: получите наслаждение от прикосновений любимого человека или животного, проникнитесь прелестью пробуждающегося города. Умение радоваться простым вещам, находить в каждом мгновении что-то хорошее делает нас более спокойными и гармоничными.</p>
          <h2>Обида.</h2>
          <p>Для того чтобы контролировать обиду, нужно лучше понять как себя (свои ожидания), так и другого (причины его поведения). Составьте список своих ожиданий относительно поведения близкого человека, стараясь ничего не забыть. Затем попробуйте оценить, какие его поступки влияют на вашу жизнь, а какие — не очень. Например, так ли сильно влияет на вашу жизнь, если муж не ставит тапочки на отведенное место? Может быть, ради вашего собственного спокойствия стоит вычеркнуть этот или другой пункт из списка?</p>
          <p>Далее проверьте,  говорили ли вы близким о своих желаниях? Если нет, то вы можете оказаться в такой анекдотичной ситуации. Пожилая женщина страдала от бессонницы. Когда она обратилась к психологу, он спросил, почему она не может заснуть. «Муж перед сном каждый вечер долго читает газеты, и шелест страниц мне мешает», — ответила клиентка. «Почему же вы не скажете ему об этом?» — «А разве он сам не понимает, что мешает мне спать?»Эта ситуация показывает, как тяжело — и для самого человека, и для его близких — когда он не говорит о своих обидах. Задумайтесь: ведь наши близкие могут не уметь читать ваши мысли. Между тем, обиды копятся и начинают разрушать как самого человека, так и его отношения с окружающими.</p>
          <p>Если вы обиделись, нужно поговорить с тем, кто, по вашему мнению, поступил с вами несправедливо, задать ему те вопросы, которые вас мучают. Скажите о том, что вас не устраивает в поведении окружающих, и это позволит избежать затяжных обид.</p>
          <p>Особо опасным поводом для обиды является ожидание не только действий, но и чувств другого человека. Допустим, вы каждый выходной проводите на даче, но нельзя требовать от других, чтобы они так же получали от этого удовольствие. Попытки навязать свои чувства как «правильные» приводят к желанию отгородиться от того, кто так себя ведет.</p>
        <p>Итак, попробуйте:</p>
        <ul>
          <li>перестать ожидать от других того, что им не по силам;</li>
          <li>оценивать поведение другого, используя в качестве критерия оценки ваши ожидания, которые могут быть ошибочными и нереалистичными;</li>
          <li>не связывать с прогнозируемым поведением окружающих собственное удовлетворение, радость или благополучие.</li>
        </ul>
        <p>Бывает и так, что окружающие принуждают нас к выполнению таких правил поведения, следовать которым мы не в силах. Чтобы нейтрализовать вину в этом случае, необходимо поставить себя на место обижающегося на вас, понять его ожидания, затем оценить свое поведение с точки зрения ожиданий другого. Затем можно спросить его, может ли он вести себя в соответствии с теми требованиями, которые накладывает на вас. Это позволит ему оценить, насколько реалистичны его ожидания.</p>
        </Accordion.Body>
      </Accordion.Item>
    </Accordion>

  </div>
}

export default Articles;
