import style from './MainPage.module.css';
import img1 from '../../../Картинки/MainPage1.jpg'
import img2 from '../../../Картинки/MainPage2.jpg'
import img3 from '../../../Картинки/MainPage3.jpg'

const MainPage = () => {
  return <div className={style.MainPage}>
    <img src={img1} align="left" />
    <h2>Что такое любовь к себе и почему так важно научиться по-настоящему любить себя?</h2>
    <p>«Просто полюби себя». «Знай себе цену». «Не полюбив себя, ты не можешь любить других и строить гармоничные отношения». «Любовь к себе — основа ментального здоровья».
      Все эти фразы мы слышим ежедневно — то и дело вылавливаем их в потоке информационного шума,
      а иногда перестаем обращать внимание на «вездесущий» совет: «Полюби себя!». Все говорят о любви к себе: коучи, психологи, нутрициологи, спортсмены и журналисты. </p>
    <h2>Но что же это значит?</h2>
    <p> У любви к себе нет четкого определения — как и однозначного ответа на вопрос: «Что такое любовь?». Любить себя- означает проявлять большое уважение ко всему, что вас касается, что находится внутри и снаружи. Это глубокая благодарность за чудо вашего тела, вашего ума и вашей души. Любить себя - это ценить себя до такой степени, пока ваше сердце не начнёт разрываться, переполненное радостью быть ВАМИ.</p>
    <img src={img2} align="right" />
    <p>Любовь к себе проявляется в самоподдержке в трудных ситуациях, мудром принятии своих особенностей и неудач в прошлом. Человек, который любит себя, не будет заниматься самокритикой: корить за то, что провел выходные перед телевизором, не успел похудеть к лету. Находясь в гармонии с собой, он будет терпимее относиться к другим.</p>
    <p>Многих из нас вырастили «хорошими девочками» и «хорошими мальчиками». С такими установками мы всю жизнь стараемся доказать свою «хорошесть» в ущерб себе. Будто полюбить сами себя можем только после того, как другие нас полюбят, похвалят, оценят. Но по-настоящему любить себя – это ощущать себя вне оценок окружающих, а в собственных критериях успешности и морали, это верить в себя.</p>
    <h2>Почему же так важно научиться любить себя?</h2>
    <p>Как и всё в этом мире, любовь подчиняется закону взаимообмена: сколько даете, столько и получаете. Поэтому от того, насколько вы любите и цените себя, напрямую зависит то, насколько вас любят и ценят окружающие. Помимо этого любовь к себе дает вам уверенность в себе. Люди, которые любят себя, имеют больше шансов получить лучшую работу, продвижение и больше друзей и поклонников. Когда вы любите себя, то и мир меняется вокруг вас. Всё вокруг становится более красивым и привлекательным. Это позволяет смотреть на вещи, людей и жизнь с другой точки зрения, с лучшей перспективы, видеть новые возможности, общаться на позитиве.</p>
    <p>Если человек считает, что самого себя любить – плохо и неприлично, а любить надо других людей, он рискует прожить жизнь в угоду этим другим. Будет ли такая жизнь счастливой? Я думаю вы уже ответили сами себе на этот вопрос...</p>
    <h2>С чего начать свой путь к любви?</h2>
    <img src={img3} align="left"/>
    <p>Прежде всего, нужно перестать бояться выражать свои эмоции и чувства. Так мы постепенно станем естественными и непринужденными, что позволит ощутить внутреннюю легкость.</p>
    <p>Еще не менее важно научиться прощать, прощать себя и окружающих. Ведь мы действительно «любим настолько, насколько умеем прощать».</p>
    <p>Заняться следует и своей неповторимой внешностью. Но нужно делать это, прежде всего, для себя, для собственного здоровья. Здоровый человек всегда готов с радостью идти по жизни, идти к новым открытиям.</p>
    <p>Просто необходимо хотя бы несколько часов в день уделять себе своему личностному развитию. Чаще читайте, занимайтесь спортом, найдите для себя увлечение, хобби которое приносило бы Вам удовольствие и моральное удовлетворение.</p>
    <p>Ведь постоянно заботясь о своих близких, отдавая им себя без остатка мы забываем о собственном «Я», но забывать о себе не стоит. Попробуйте разделить домашние обязанности между членами своей семьи, так чтобы у каждого из Вас появилось несколько часов свободного времени, которое можно было бы посвятить саморазвитию.</p>
    <p>А также пару пунктиков, которые помогут сформировать и поддерживать любовь к себе:</p>
    <p>1.	Фильтруйте свое окружение, иными словами — не водитесь с кем попало, сами формируйте свой круг общения.</p>
    <p>2.	Чаще проявляйте добрые эмоции, совершайте добрые дела — просто так, не задумываясь о том, как к этому отнесутся окружающие.</p>
    <p>3.	Не приобщайтесь к порокам и сомнительным удовольствиям — они разрушают личность изнутри.</p>
    <p>4.	Не ждите от других людей награды или похвалы — хвалите и вознаграждайте себя сами.</p>
    <p>5.	Бывайте в уединении, где вас никто не потревожит, где можно побыть с самим собой, созерцать и испытывать умиротворение.</p>
    <p>6.	Больше общайтесь с людьми, которые вам приятны.</p>
    <p>7.	Чаще наблюдайте за тем, что придает вам силы.</p>




  </div>
}

export default MainPage;
